/*
1. Створіть змінні a і b з довільними числами. Виведіть у консоль результат їхнього перемноження
2. Створіть змінні с і d з довільними числами. Виведіть у консоль результат їхнього поділу.
3. Визначте змінні зі значеннями 33, false, 'javascript' та виведіть у консоль їхні типи даних
4. Переробіть зазначений нижче код на скорочений формат, використовуючи оператори 
+=, -=, *=, /=, ++, --


let num = 1;
num = num + 1;
num = num - 1;
num = num + 11;
num = num - 11;
num = num * 11;
num = num / 11;


*/

let num = 1;
num++;
num--;

num += 11;
num -= 11;
num *= 11;
num /= 11;