const array = [5, 3, -9, 21, -5, 1, -2, 4];

/* Створити новий масив, в який попадуть тільки ті елементи зі старого масиву, які більше 0 */

function filterFunc(elem){
    return elem > 0
} 
/*
Функція приймає 1 аргумент - кожен елемент початкового масиву.
Ф. повертає true, якщо елемент підходить (пройшов перевірку) і має увійти в новий масив
false - якщо елемент не підходить

*/

const filteredArray = array.filter(filterFunc)


/*

Створити новий масив, в який увійдуть тільки парні елементи початкового масива


*/