/* Оператор умови */
/* if - якщо (если) */
/* if (логічна операція, результатом якої буде тип даних Boolean) {
   блок коду
}
Блок коду виконується тільки тоді, коли логічна операція = true
*/

if (2+2 == 5) {
    console.log(true); // виконається тільки тоді, якщо умова = true
    {
        {
            // інші блоки коду
        }
    }
}



/* if-else */
/* else - інакше (в противном случае) */

/* if (логічна умова) {
     блок коду, який виконається, якщо умова = true
 } else {
     блок коду, який виконається, якщо умова = false
 }
  */

 if ( 2 + 2 === 5) {
    console.log(true); // якщо умова = true
 } else {
    console.log(false); // якщо умова = false
 }


 /* Task 1 
1. Створити змінні
a = 3;
b = 6;
n = 8;

2. Якщо b - парне, тоді n збільшити на 5, у іншому випадку  a зробити = 15

3. Вивести змінні на консоль

*/

let a = 3;
let b = 6;
let n = 8;

if (b % 2 === 0) {
    n = n + 5;
} else {
    a = 15;
}

console.log(a, b, n);



///////

/* Автоматичне приведення до Boolean */

if (3) {
    // блок true 
} else {
    // блок false
}


/* Задачка з подвохом */


let i = 0;
if (i++) { // Постфіксна форма інкременту!!!!
    console.log(true);
    console.log(i);
} else {
    console.log(false);
    console.log(i);
}

// false


////////////////

/* if - else if - else */

/*
if (умова 1) {
    блок коду, який виконається, якщо умова1 = true
} else if (умова 2) {
    блок коду, який виконається, якщо умова2 = true
} else {
    блок коду, який виконається, якщо умова1 і умова2 = false
}


*/


// Якщо r > 12 - вивести на консоль 'більше 12', а якщо < 5 - вивести 'менша за 5', в іншому випадку - вивести "в діапазоні між 5 і 12"

let r = 6;
if (r > 12) {
    console.log('more than 12');
} else if (r < 5) {
    console.log('less than 5');
} else {
    console.log('in 5 to 12');
}

/////////

// user.avatar = 'https://image.com/userimage'
// user.avatar = undefined
// if (user.avatar) {
//     // показуємо аватар юзера
// } else {
//     // показуємо аватар-заглушку
// }

/////////

/* Більше-або-дорівнює і менше-або-дорівнює 
*/

3 >= 3; // true
3 >= 2; // true

5 <= 6; // true
4 <= 4; // true


/* Task 2 

1. Маємо змінну min = 20

2. Якщо min попадає в першу чверть години - вивести на консоль "перша чверть"
Якщо min попадає в другу чверть години - - вивести на консоль "друга чверть",
Якщо min попадає в третю чверть години - - вивести на консоль "третя чверть",
Якщо min попадає в четверта чверть години - - вивести на консоль "четверта чверть".

*/

let min = 'aaaaaa';
Number(min); // NaN
if (min >= 0 && min <= 15) {
    console.log('перша чверть');
} else if (min > 15 && min <= 30) {
    console.log('друга чверть');
} else if (min > 30 && min <= 45) {
    console.log('третя чверть');
} else if (min > 45 && min <= 60) {
    console.log('четверта чверть');
} else {
    console.log('число не підходить');
}


let l = 0, j=5, k=10;