/* Логічні оператори */

// Boolean

const a = true;
!a // false;
// ! - заперечення (отрицание)
!!a // true
// !! - подвійне заперечення, використовується для приведення значення до типу даних Boolean

Boolean(); // явне приведення типу до Boolean

4 > 5; // false
7 < 9; // true

///---- Порівняння рядків
'a' > 'A' // true, тому що в 'а' код 61, а в 'A' - 40.
'b' < 'c'; //true


// ==  - приводить операнди до одного типу даних, і потім порівнює. НЕ РЕКОМЕНДУЄТЬСЯ
5 == 6; // false
6 == 6; // true

// === - порівнює операнди і за значенням, і за типом даних. РЕКОМЕНДУЄТЬСЯ.
5 === '5'; // false
5 === 5; // true

// != - не дорівнює, з приведенням типу
// !== - не дорівнює без приведення типу

6 !== 7 // true
5 !== 5 // false


'A' > 'text'; //false
'cat' > 'cit'; //false


///////////// Логічні оператори && (ТА/И), || (АБО/ИЛИ)

// && -  Повертає true, якщо обидва операнди = true, у іншому випадку повертає false
true && false // false
true && true // true
false && false // false
false && false // false

// || - Повертає true, якщо хоч один з операндів = true, в іншому випадку повертає false
true || false // true
true || true // true
false || true // true
false || false // false


'' || 'a' // true
undefined || null // false
0 && 1 // false
5 && 6 // true