/*
1. Створіть змінну і присвойте їй значення null.
2. Створіть іншу змінну і присвойте їй значення 5.
3. Створіть іншу змінну і присвойте їй значення '2'.
4. Складіть змінні з пунктів 2 і 3, результат виведіть у консоль. Який тип даних ви отримали?
5. Від змінної з пункту 3 відніміть змінну з пункту два. Результат виведіть на консоль. Який тип даних ви отримали?
6. До змінної з пункту 1 додайте змінну з пункту 2. Результат виведіть на консоль. Який тип даних ви отримали?
7.А який результат ви отримаєте, якщо скласти 10 і undefined?
*/